# **Задача:** Создать калькулятор для работы с рациональными и комплексными числами,
# организовать меню, добавив в неё систему логирования.
#
# В рамках этого обсуждения студентам надо нарисовать “архитектуру”
# (например, в виде блок-схемы) для работы данного приложения.
#
# (по лекции № 4 )
#
1).      комплексное число:

        4 + 3i
        6 + 2i

                += 10 + 5i

                -= -2 + 1i

                *= (4+3i)*(6+2i) = 4*6 + 4*2i + 3i*6 + 3i*2i = 24+8i+18i+6i^2
                                            где условие мнимых чисел: i^2 = -1
                                                             = 24 + 26i - 6 = 18+26i
                /= ... hard
#
 2). создаем диаграмму


