# 2. Найдите корни квадратного уравнения Ax² + Bx + C = 0
# двумя способами:
#
#  - с помощью математических формул нахождения корней квадратного уравнения
#
#  - с помощью дополнительных библиотек Python
 

# ======== Решение задачи №2 =============

list_num = input('Введи знач. коэфф-ов a,b,z через пробел: ').split()

print(list_num)

a,b,z = list(map(int, list_num))

d = b ** 2 - 4 * a * z

if d < 0:
    print('Корней нет!')
elif d == 0:
    x = -b/(2*a) #-1*(b/(2*a))
    print(f'x1_ = {x} and', end=' ')
else:
    x1 = (-b + d ** 0.5) / (2 * a)
    print(f'x1_ = {x1} and', end=' ')
    x2 = (-b - d ** 0.5) / (2 * a)
    print(f'x2_ = {x2}')





 






